{"recipeList":[{"recipeName":"Fried Chicken and Fries","date":"2023-12-04T22:33:31.872197800","directions":"1. Preheat the oven to 350 degrees F.\n2. Cut the potatoes and French fries into small cubes.\n3. Place the potatoes and French fries in a greased baking dish.\n4. Rinse and pat dry the chicken breasts.\n5. Place the chicken in the baking dish.\n6. Sprinkle the paprika, garlic powder, salt, and pepper over the potatoes and French fries.\n7. Add the chopped onions to the baking dish.\n8. Bake for 45 minutes or until the potatoes are tender and the chicken is cooked through.","mealType":"Breakfast","ingredients":"French Fries (3 cups), Potatoes (2 cups), Chicken (2 breasts), Onion (1\/2 cup), Paprika (2 tablespoons), Garlic Powder (1 teaspoon), Salt and Pepper (to taste),"},{"recipeName":"Chicken and Potato Fries","date":"2023-12-04T22:33:01.009244200","directions":"1. Preheat the oven to 375 degrees.\n2. In a large bowl, combine the French fries, potatoes, chicken, olive oil, garlic and parsley. Toss until everything is evenly coated.\n3. Spread the mixture onto a baking sheet. Bake for 25-30 minutes, stirring halfway through.\n4. Serve hot.","mealType":"Lunch","ingredients":"French fries (300g), potatoes (2 medium), chicken (500g), olive oil (1 tablespoon), garlic (4 cloves, minced), parsley (2 tablespoons, chopped)"},{"recipeName":"Potato Chicken-Fry Casserole","date":"2023-12-04T22:32:16.984866900","directions":"1. Preheat the oven to 350 degrees.\n2. Grease a 9x13 baking dish with butter. \n3. Layer the bottom of the dish with the French fries. \n4. Peel and slice the potatoes and layer them on top of the French fries. \n5. Layer the chicken breasts on top of the potatoes. \n6. Sprinkle the onions and cheddar cheese on top of the chicken. \n7. Pour the cream of mushroom soup over the ingredients in the dish. \n8. Cover the dish with foil and bake in the preheated oven for 40 minutes. \n9. Take the foil off of the dish and bake for an additional 10 minutes, or until the cheese is bubbling and golden brown. Enjoy!","mealType":"Dinner","ingredients":"French fries (2 cups), potatoes (3 cups), chicken (2 breasts), onion (1\/2 cup), cheddar cheese (1\/2 cup), cream of mushroom soup (1 can)"}]}